templates/cves/cve-2019-2725-weblogic-deserialization.yaml

name: CVE-2019-2725 Oracle WebLogic Server Deserialization RCE
description: Detects CVE-2019-2725, an unauthenticated remote code execution vulnerability in Oracle WebLogic Server wls9-async and wls-wsat components. The vulnerability leverages Java deserialization of crafted XML payloads.
severity: critical
tags:
  - java
  - weblogic
cwe: CWE-502

requests:
  - method: POST
    path: /wls9_async_response/AsyncResponseService
    headers:
      Content-Type: text/xml; charset=utf-8
    body: "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:asy=\"http://www.bea.com/async/AsyncResponseService\"><soapenv:Header><wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work=\"http://bea.com/2004/06/soap/workarea/\"><java><class><string>oracle.toplink.internal.sessions.UnitOfWorkChangeSet</string><void><array class=\"byte\" length=\"244\"><void index=\"0\"><byte>-84</byte></void></array></void></class></java></work:WorkContext></soapenv:Header><soapenv:Body><asy:onAsyncDelivery/></soapenv:Body></soapenv:Envelope>"
  - method: GET
    path: /_async/AsyncResponseService

matchers:
  - status_code: 200
  - body_contains: "WebLogic"

extractors:
  - name: weblogic_version
    regex: "WebLogic Server ([0-9.]+)"
